cask_args appdir: '/Applications'
tap 'homebrew/cask'

brew 'bash'
brew 'zsh'
brew 'git'
brew 'vim'
brew 'coreutils'
brew 'imagemagick'
brew 'postgresql'
brew 'redis'
brew 'tree'
brew 'dfu-programmer'
brew 'docker'
brew 'docker-compose'
brew 'yarn'
brew 'the_silver_searcher'

cask '1password'
cask 'flux'
cask 'iterm2'
cask 'alfred'
cask 'caffeine'
cask 'spotify'
cask 'dropbox'
cask 'karabiner-elements'
cask 'stretchly'
cask 'notion'
cask 'zoom'
cask 'imageoptim'
cask 'selfcontrol'
cask 'discord'
cask 'logi-options+'
cask 'logitech-camera-settings'
cask 'docker'

# from Mac app store
# Skitch, Be Focused, Color Note, Parcel, Pocket, Meeter, Slack, Todoist, WhatsApp

# to compile QMK firmware
# https://docs.qmk.fm/#/getting_started_build_tools?id=macos
tap 'osx-cross/avr'
tap 'PX4/homebrew-px4'
brew 'avr-gcc@8'
brew 'dfu-programmer'
brew 'dfu-util'
brew 'gcc-arm-none-eabi'
brew 'avrdude'
