cask_args appdir: '/Applications'
tap 'homebrew/cask'

brew 'bash'
brew 'git'
brew 'vim'
brew 'coreutils'
brew 'imagemagick'
brew 'postgresql'
brew 'redis'
brew 'tree'
brew 'dfu-programmer'
brew 'zsh'

cask 'flux'
cask 'iterm2'
cask 'alfred'
cask 'caffeine'
cask 'spotify'
cask 'dropbox'
cask 'karabiner-elements'
cask 'stretchly'

# to compile QMK firmware
# https://docs.qmk.fm/#/getting_started_build_tools?id=macos
tap 'osx-cross/avr'
tap 'PX4/homebrew-px4'
brew 'avr-gcc@8'
brew 'dfu-programmer'
brew 'dfu-util'
brew 'gcc-arm-none-eabi'
brew 'avrdude'
